# порядковый номер самого задания на курсе - 9
#
# номер задачи из задания - 3
#
# краткое название -  Реализуйте динамическую хэш-таблицу, которая автоматически удваивает свой размер, если уровень заполненности превышает заданный порог (например, 75%).
#Реализация должна корректно перераспределять все элементы в новую, более крупную хэш-таблицу с минимальными затратами по времени.
#
# сложность решения (O-большое)
# временнАя -
# пространственная -

# рефлексия по эталонному варианту решения:
#