namespace OOAP2.lesson23;


//подсказал chat gpt:)

//имеем класс Game и VideoGame, Web3Game
//постусловие метода Play - игрок может проходить игру от начала до конца
//предусловие метода Play - у игрока есть все нужные ресурсы для прохождения

//в Web3Game не стоит усилять предусловие, например заставлять игроков иметь определенное количество токенов на балансе, это вызовет хейт и снизит доступность игры.  
//в VideoGame не стоит ослаблять постусловие, например игрок не может пройти игру из-за сильной сложности или других проблем



